Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71N20.PIC
      <edc:SFRDef edc:_addr="0x400340E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_TXBCIE" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="CFIE0" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE2" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE3" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE4" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE5" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE6" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE7" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE8" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE9" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE10" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE11" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE12" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE13" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE14" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE15" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE16" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE17" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE18" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE19" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE20" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE21" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE22" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE23" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE24" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE25" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE26" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE27" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE28" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE29" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE30" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE31" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400340E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400340F0" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnn--" edc:cname="MCAN1_TXEFC" edc:impl="0x3F3FFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFSA" edc:desc="Event FIFO Start Address" edc:nzwidth="0xE"/>
            <edc:SFRFieldDef edc:cname="EFS" edc:desc="Event FIFO Size" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFWM" edc:desc="Event FIFO Watermark" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400340F4" edc:access="------rr---rrrrr---rrrrr--rrrrrr" edc:cname="MCAN1_TXEFS" edc:impl="0x31F1F3F" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="EFFL" edc:desc="Event FIFO Fill Level" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFGI" edc:desc="Event FIFO Get Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFPI" edc:desc="Event FIFO Put Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFF" edc:desc="Event FIFO Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:desc="Tx Event FIFO Element Lost" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400340F8" edc:access="---------------------------nnnnn" edc:cname="MCAN1_TXEFA" edc:impl="0x1F" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="EFAI" edc:desc="Event FIFO Acknowledge Index" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400340FC" edc:offset="0x3F04"/>
      <edc:SFRDef edc:_addr="0x40038000" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVCTRL" edc:impl="0x1FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="UADD" edc:desc="USB Address" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="Address Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DETACH" edc:desc="Detach" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RMWKUP" edc:desc="Remote Wake-Up" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:desc="Mode Configuration" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW_POWER" edc:desc="For a better consumption, if high speed is not needed." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_SPEED" edc:desc="Forced high speed." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FORCED_FS" edc:desc="The peripheral remains in Full-speed mode whatever the host speed capability." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LS" edc:desc="Low-Speed Mode Force" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTJ" edc:desc="Test mode J" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTK" edc:desc="Test mode K" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTPCKT" edc:desc="Test packet mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="Specific Operational mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
