Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71N20.PIC
      <edc:AdjustPoint edc:_addr="0x40068010" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40068014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MS1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MCS" edc:desc="MediaLB Channel Status [63:32] (cleared by writing a 0)" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40068018" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40068020" edc:access="--------------------------nnnnnn" edc:cname="MLB_MSS" edc:impl="0x3F" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="RSTSYSCMD" edc:desc="Reset System Command Detected in the System Quadlet (cleared by writing a 0)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LKSYSCMD" edc:desc="Network Lock System Command Detected in the System Quadlet (cleared by writing a 0)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ULKSYSCMD" edc:desc="Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSSYSCMD" edc:desc="Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWSYSCMD" edc:desc="Software System Command Detected in the System Quadlet (cleared by writing a 0)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERVREQ" edc:desc="Service Request Enabled" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40068024" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MLB_MSD" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="SD0" edc:desc="System Data (Byte 0)" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SD1" edc:desc="System Data (Byte 1)" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SD2" edc:desc="System Data (Byte 2)" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SD3" edc:desc="System Data (Byte 3)" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40068028" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4006802C" edc:access="--nnnnnn-nnnnnnn--------------nn" edc:cname="MLB_MIEN" edc:impl="0x3F7F0003" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="ISOC_PE" edc:desc="Isochronous Rx Protocol Error Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISOC_BUFO" edc:desc="Isochronous Rx Buffer Overflow Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="SYNC_PE" edc:desc="Synchronous Protocol Error Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARX_DONE" edc:desc="Asynchronous Rx Done Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARX_PE" edc:desc="Asynchronous Rx Protocol Error Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARX_BREAK" edc:desc="Asynchronous Rx Break Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ATX_DONE" edc:desc="Asynchronous Tx Packet Done Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ATX_PE" edc:desc="Asynchronous Tx Protocol Error Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ATX_BREAK" edc:desc="Asynchronous Tx Break Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRX_DONE" edc:desc="Control Rx Packet Done Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRX_PE" edc:desc="Control Rx Protocol Error Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRX_BREAK" edc:desc="Control Rx Break Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTX_DONE" edc:desc="Control Tx Packet Done Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTX_PE" edc:desc="Control Tx Protocol Error Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTX_BREAK" edc:desc="Control Tx Break Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40068030" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x4006803C" edc:access="----------------nnnnnnnnnn------" edc:cname="MLB_MLBC1" edc:impl="0xFFC0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="MediaLB Lock Error Status (cleared by writing a 0)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKM" edc:desc="MediaLB Clock Missing Status (cleared by writing a 0)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NDA" edc:desc="Node Device Address" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40068040" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x40068080" edc:access="----------------n-------------nn" edc:cname="MLB_HCTL" edc:impl="0x8003" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="RST0" edc:desc="Address Generation Unit 0 Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RST1" edc:desc="Address Generation Unit 1 Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="EN" edc:desc="HBI Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40068084" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40068088" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_HCMR0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHM" edc:desc="Bitwise Channel Mask Bit [31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006808C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_HCMR1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHM" edc:desc="Bitwise Channel Mask Bit [31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40068090" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MLB_HCER0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CERR" edc:desc="Bitwise Channel Error Bit [31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
