Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71N20.PIC
      <edc:AdjustPoint edc:_addr="0x40070100" edc:offset="0x7F00"/>
      <edc:SFRDef edc:_addr="0x40078000" edc:access="---------rrrrrrrrrrrrrrrrrrrrrrr" edc:cname="XDMAC_GTYPE" edc:impl="0x7FFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NB_CH" edc:desc="Number of Channels Minus One" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="FIFO_SZ" edc:desc="Number of Bytes" edc:nzwidth="0xB"/>
            <edc:SFRFieldDef edc:cname="NB_REQ" edc:desc="Number of Peripheral Requests Minus One" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078004" edc:access="-----------------------n----nnnn" edc:cname="XDMAC_GCFG" edc:impl="0x10F" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="CGDISREG" edc:desc="Configuration Registers Clock Gating Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CGDISPIPE" edc:desc="Pipeline Clock Gating Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CGDISFIFO" edc:desc="FIFO Clock Gating Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CGDISIF" edc:desc="Bus Interface Clock Gating Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="BXKBEN" edc:desc="Boundary X Kilobyte Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078008" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="XDMAC_GWAC" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="PW0" edc:desc="Pool Weight 0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PW1" edc:desc="Pool Weight 1" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PW2" edc:desc="Pool Weight 2" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PW3" edc:desc="Pool Weight 3" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007800C" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GIE" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="IE0" edc:desc="XDMAC Channel 0 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE1" edc:desc="XDMAC Channel 1 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE2" edc:desc="XDMAC Channel 2 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE3" edc:desc="XDMAC Channel 3 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE4" edc:desc="XDMAC Channel 4 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE5" edc:desc="XDMAC Channel 5 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE6" edc:desc="XDMAC Channel 6 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE7" edc:desc="XDMAC Channel 7 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE8" edc:desc="XDMAC Channel 8 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE9" edc:desc="XDMAC Channel 9 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE10" edc:desc="XDMAC Channel 10 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE11" edc:desc="XDMAC Channel 11 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE12" edc:desc="XDMAC Channel 12 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE13" edc:desc="XDMAC Channel 13 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE14" edc:desc="XDMAC Channel 14 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE15" edc:desc="XDMAC Channel 15 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE16" edc:desc="XDMAC Channel 16 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE17" edc:desc="XDMAC Channel 17 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE18" edc:desc="XDMAC Channel 18 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE19" edc:desc="XDMAC Channel 19 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE20" edc:desc="XDMAC Channel 20 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE21" edc:desc="XDMAC Channel 21 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE22" edc:desc="XDMAC Channel 22 Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE23" edc:desc="XDMAC Channel 23 Interrupt Enable Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078010" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GID" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="ID0" edc:desc="XDMAC Channel 0 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID1" edc:desc="XDMAC Channel 1 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID2" edc:desc="XDMAC Channel 2 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID3" edc:desc="XDMAC Channel 3 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID4" edc:desc="XDMAC Channel 4 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID5" edc:desc="XDMAC Channel 5 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID6" edc:desc="XDMAC Channel 6 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID7" edc:desc="XDMAC Channel 7 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID8" edc:desc="XDMAC Channel 8 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID9" edc:desc="XDMAC Channel 9 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID10" edc:desc="XDMAC Channel 10 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID11" edc:desc="XDMAC Channel 11 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID12" edc:desc="XDMAC Channel 12 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID13" edc:desc="XDMAC Channel 13 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID14" edc:desc="XDMAC Channel 14 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID15" edc:desc="XDMAC Channel 15 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID16" edc:desc="XDMAC Channel 16 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID17" edc:desc="XDMAC Channel 17 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID18" edc:desc="XDMAC Channel 18 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID19" edc:desc="XDMAC Channel 19 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID20" edc:desc="XDMAC Channel 20 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID21" edc:desc="XDMAC Channel 21 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID22" edc:desc="XDMAC Channel 22 Interrupt Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ID23" edc:desc="XDMAC Channel 23 Interrupt Disable Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078014" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="XDMAC_GIM" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="IM0" edc:desc="XDMAC Channel 0 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM1" edc:desc="XDMAC Channel 1 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM2" edc:desc="XDMAC Channel 2 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM3" edc:desc="XDMAC Channel 3 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM4" edc:desc="XDMAC Channel 4 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM5" edc:desc="XDMAC Channel 5 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM6" edc:desc="XDMAC Channel 6 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM7" edc:desc="XDMAC Channel 7 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM8" edc:desc="XDMAC Channel 8 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM9" edc:desc="XDMAC Channel 9 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM10" edc:desc="XDMAC Channel 10 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM11" edc:desc="XDMAC Channel 11 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM12" edc:desc="XDMAC Channel 12 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM13" edc:desc="XDMAC Channel 13 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM14" edc:desc="XDMAC Channel 14 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM15" edc:desc="XDMAC Channel 15 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM16" edc:desc="XDMAC Channel 16 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM17" edc:desc="XDMAC Channel 17 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM18" edc:desc="XDMAC Channel 18 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM19" edc:desc="XDMAC Channel 19 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM20" edc:desc="XDMAC Channel 20 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM21" edc:desc="XDMAC Channel 21 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM22" edc:desc="XDMAC Channel 22 Interrupt Mask Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM23" edc:desc="XDMAC Channel 23 Interrupt Mask Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078018" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="XDMAC_GIS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="IS0" edc:desc="XDMAC Channel 0 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS1" edc:desc="XDMAC Channel 1 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS2" edc:desc="XDMAC Channel 2 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS3" edc:desc="XDMAC Channel 3 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS4" edc:desc="XDMAC Channel 4 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS5" edc:desc="XDMAC Channel 5 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS6" edc:desc="XDMAC Channel 6 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS7" edc:desc="XDMAC Channel 7 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS8" edc:desc="XDMAC Channel 8 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS9" edc:desc="XDMAC Channel 9 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS10" edc:desc="XDMAC Channel 10 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS11" edc:desc="XDMAC Channel 11 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS12" edc:desc="XDMAC Channel 12 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS13" edc:desc="XDMAC Channel 13 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS14" edc:desc="XDMAC Channel 14 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS15" edc:desc="XDMAC Channel 15 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS16" edc:desc="XDMAC Channel 16 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS17" edc:desc="XDMAC Channel 17 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS18" edc:desc="XDMAC Channel 18 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS19" edc:desc="XDMAC Channel 19 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS20" edc:desc="XDMAC Channel 20 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS21" edc:desc="XDMAC Channel 21 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS22" edc:desc="XDMAC Channel 22 Interrupt Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IS23" edc:desc="XDMAC Channel 23 Interrupt Status Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007801C" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GE" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="EN0" edc:desc="XDMAC Channel 0 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN1" edc:desc="XDMAC Channel 1 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN2" edc:desc="XDMAC Channel 2 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN3" edc:desc="XDMAC Channel 3 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN4" edc:desc="XDMAC Channel 4 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN5" edc:desc="XDMAC Channel 5 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN6" edc:desc="XDMAC Channel 6 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN7" edc:desc="XDMAC Channel 7 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN8" edc:desc="XDMAC Channel 8 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN9" edc:desc="XDMAC Channel 9 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN10" edc:desc="XDMAC Channel 10 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN11" edc:desc="XDMAC Channel 11 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN12" edc:desc="XDMAC Channel 12 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN13" edc:desc="XDMAC Channel 13 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN14" edc:desc="XDMAC Channel 14 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN15" edc:desc="XDMAC Channel 15 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN16" edc:desc="XDMAC Channel 16 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN17" edc:desc="XDMAC Channel 17 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN18" edc:desc="XDMAC Channel 18 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN19" edc:desc="XDMAC Channel 19 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN20" edc:desc="XDMAC Channel 20 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN21" edc:desc="XDMAC Channel 21 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN22" edc:desc="XDMAC Channel 22 Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN23" edc:desc="XDMAC Channel 23 Enable Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078020" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DI0" edc:desc="XDMAC Channel 0 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:desc="XDMAC Channel 1 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:desc="XDMAC Channel 2 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:desc="XDMAC Channel 3 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:desc="XDMAC Channel 4 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:desc="XDMAC Channel 5 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:desc="XDMAC Channel 6 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:desc="XDMAC Channel 7 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:desc="XDMAC Channel 8 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:desc="XDMAC Channel 9 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:desc="XDMAC Channel 10 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:desc="XDMAC Channel 11 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:desc="XDMAC Channel 12 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:desc="XDMAC Channel 13 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:desc="XDMAC Channel 14 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:desc="XDMAC Channel 15 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:desc="XDMAC Channel 16 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:desc="XDMAC Channel 17 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:desc="XDMAC Channel 18 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:desc="XDMAC Channel 19 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:desc="XDMAC Channel 20 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:desc="XDMAC Channel 21 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:desc="XDMAC Channel 22 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:desc="XDMAC Channel 23 Disable Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078024" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="XDMAC_GS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="ST0" edc:desc="XDMAC Channel 0 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST1" edc:desc="XDMAC Channel 1 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST2" edc:desc="XDMAC Channel 2 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST3" edc:desc="XDMAC Channel 3 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST4" edc:desc="XDMAC Channel 4 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST5" edc:desc="XDMAC Channel 5 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST6" edc:desc="XDMAC Channel 6 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST7" edc:desc="XDMAC Channel 7 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST8" edc:desc="XDMAC Channel 8 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST9" edc:desc="XDMAC Channel 9 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST10" edc:desc="XDMAC Channel 10 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST11" edc:desc="XDMAC Channel 11 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST12" edc:desc="XDMAC Channel 12 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST13" edc:desc="XDMAC Channel 13 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST14" edc:desc="XDMAC Channel 14 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST15" edc:desc="XDMAC Channel 15 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST16" edc:desc="XDMAC Channel 16 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST17" edc:desc="XDMAC Channel 17 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST18" edc:desc="XDMAC Channel 18 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST19" edc:desc="XDMAC Channel 19 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST20" edc:desc="XDMAC Channel 20 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST21" edc:desc="XDMAC Channel 21 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST22" edc:desc="XDMAC Channel 22 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST23" edc:desc="XDMAC Channel 23 Status Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
