Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71N20.PIC
      <edc:SFRDef edc:_addr="0x40078028" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_GRS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RS0" edc:desc="XDMAC Channel 0 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS1" edc:desc="XDMAC Channel 1 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS2" edc:desc="XDMAC Channel 2 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS3" edc:desc="XDMAC Channel 3 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS4" edc:desc="XDMAC Channel 4 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS5" edc:desc="XDMAC Channel 5 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS6" edc:desc="XDMAC Channel 6 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS7" edc:desc="XDMAC Channel 7 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS8" edc:desc="XDMAC Channel 8 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS9" edc:desc="XDMAC Channel 9 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS10" edc:desc="XDMAC Channel 10 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS11" edc:desc="XDMAC Channel 11 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS12" edc:desc="XDMAC Channel 12 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS13" edc:desc="XDMAC Channel 13 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS14" edc:desc="XDMAC Channel 14 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS15" edc:desc="XDMAC Channel 15 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS16" edc:desc="XDMAC Channel 16 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS17" edc:desc="XDMAC Channel 17 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS18" edc:desc="XDMAC Channel 18 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS19" edc:desc="XDMAC Channel 19 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS20" edc:desc="XDMAC Channel 20 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS21" edc:desc="XDMAC Channel 21 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS22" edc:desc="XDMAC Channel 22 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS23" edc:desc="XDMAC Channel 23 Read Suspend Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007802C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_GWS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="WS0" edc:desc="XDMAC Channel 0 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS1" edc:desc="XDMAC Channel 1 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS2" edc:desc="XDMAC Channel 2 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS3" edc:desc="XDMAC Channel 3 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS4" edc:desc="XDMAC Channel 4 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS5" edc:desc="XDMAC Channel 5 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS6" edc:desc="XDMAC Channel 6 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS7" edc:desc="XDMAC Channel 7 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS8" edc:desc="XDMAC Channel 8 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS9" edc:desc="XDMAC Channel 9 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS10" edc:desc="XDMAC Channel 10 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS11" edc:desc="XDMAC Channel 11 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS12" edc:desc="XDMAC Channel 12 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS13" edc:desc="XDMAC Channel 13 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS14" edc:desc="XDMAC Channel 14 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS15" edc:desc="XDMAC Channel 15 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS16" edc:desc="XDMAC Channel 16 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS17" edc:desc="XDMAC Channel 17 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS18" edc:desc="XDMAC Channel 18 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS19" edc:desc="XDMAC Channel 19 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS20" edc:desc="XDMAC Channel 20 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS21" edc:desc="XDMAC Channel 21 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS22" edc:desc="XDMAC Channel 22 Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WS23" edc:desc="XDMAC Channel 23 Write Suspend Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
