Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71N20.PIC
      <edc:SFRDef edc:_addr="0x40078030" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GRWS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RWS0" edc:desc="XDMAC Channel 0 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS1" edc:desc="XDMAC Channel 1 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS2" edc:desc="XDMAC Channel 2 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS3" edc:desc="XDMAC Channel 3 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS4" edc:desc="XDMAC Channel 4 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS5" edc:desc="XDMAC Channel 5 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS6" edc:desc="XDMAC Channel 6 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS7" edc:desc="XDMAC Channel 7 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS8" edc:desc="XDMAC Channel 8 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS9" edc:desc="XDMAC Channel 9 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS10" edc:desc="XDMAC Channel 10 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS11" edc:desc="XDMAC Channel 11 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS12" edc:desc="XDMAC Channel 12 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS13" edc:desc="XDMAC Channel 13 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS14" edc:desc="XDMAC Channel 14 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS15" edc:desc="XDMAC Channel 15 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS16" edc:desc="XDMAC Channel 16 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS17" edc:desc="XDMAC Channel 17 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS18" edc:desc="XDMAC Channel 18 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS19" edc:desc="XDMAC Channel 19 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS20" edc:desc="XDMAC Channel 20 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS21" edc:desc="XDMAC Channel 21 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS22" edc:desc="XDMAC Channel 22 Read Write Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS23" edc:desc="XDMAC Channel 23 Read Write Suspend Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078034" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GRWR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RWR0" edc:desc="XDMAC Channel 0 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR1" edc:desc="XDMAC Channel 1 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR2" edc:desc="XDMAC Channel 2 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR3" edc:desc="XDMAC Channel 3 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR4" edc:desc="XDMAC Channel 4 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR5" edc:desc="XDMAC Channel 5 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR6" edc:desc="XDMAC Channel 6 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR7" edc:desc="XDMAC Channel 7 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR8" edc:desc="XDMAC Channel 8 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR9" edc:desc="XDMAC Channel 9 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR10" edc:desc="XDMAC Channel 10 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR11" edc:desc="XDMAC Channel 11 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR12" edc:desc="XDMAC Channel 12 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR13" edc:desc="XDMAC Channel 13 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR14" edc:desc="XDMAC Channel 14 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR15" edc:desc="XDMAC Channel 15 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR16" edc:desc="XDMAC Channel 16 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR17" edc:desc="XDMAC Channel 17 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR18" edc:desc="XDMAC Channel 18 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR19" edc:desc="XDMAC Channel 19 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR20" edc:desc="XDMAC Channel 20 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR21" edc:desc="XDMAC Channel 21 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR22" edc:desc="XDMAC Channel 22 Read Write Resume Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RWR23" edc:desc="XDMAC Channel 23 Read Write Resume Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
